server/src/app/controllers/application_controller.rb

     def current_user
        @user ||= User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]