server/src/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jezdufourq@gmail.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(email: user_login_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: user_id)