server/src/app/controllers/api/v1/organisation_user_controller.rb

    def index
        @user = current_user()
        @organisation_user = OrganisationUser.where("user_id = ?", @user.id)
---
SELECT "organisation_users".* FROM "organisation_users" WHERE (organisation_user.user.id = 2)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        organisation = Organisation.find_by(id: organisation_user_params[:organisation_id])
        user = User.find_by(id: organisation_user_params[:user_id])
        @organisation_user = OrganisationUser.new(user: user, organisation: organisation)
        if @organisation_user.valid?
            @organisation_user.save
---
SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "organisation_users" ("user_id", "organisation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["organisation_id", 1], ["created_at", "2021-05-17 12:49:45.276218"], ["updated_at", "2021-05-17 12:49:45.276218"]]