server/src/app/controllers/api/v1/organisations_controller.rb

SELECT "organisations".* FROM "organisations"
---
    def index
        orgs = Organisation.all

INSERT INTO "organisations" ("name", "hourly_rate", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test Orgfsfsa"], ["hourly_rate", 10], ["created_at", "2021-05-18 14:10:15.460607"], ["updated_at", "2021-05-18 14:10:15.460607"]]
SELECT "organisations".* FROM "organisations"
---
    def create
        @organisation = Organisation.new(new_organisation_params)
        if @organisation.valid?
            @organisation.save
            @organisations = Organisation.all