server/src/app/controllers/api/v1/shifts_controller.rb

    def create
        @shift = Shift.new(new_shift_params)
        if @shift.valid?
            @shift.save
            @organisation = Organisation.find(new_shift_params[:organisation_id])
            shifts = Shift.where('organisation_id = ?', @organisation.id)
---
INSERT INTO "shifts" ("start_time", "end_time", "break_length", "hours_worked", "shift_cost", "user_id", "organisation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "shifts".* FROM "shifts" WHERE (organisation_id = 4)

    def destroy
        @shift = Shift.find(params[:id])
        @shift.destroy
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 3]]